susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G43x.h
#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define TIM2_CH2_PD4_ PD4,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1
#define _TIM2_CH2_PD4_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PA9_ PA9,GPIO_AF10
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define TIM2_CH3_PD7_ PD7,GPIO_AF2
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PA9_ 1
#define _TIM2_CH3_PB10_ 1
#define _TIM2_CH3_PD7_ 1

#define TIM2_CH4_PA10_ PA10,GPIO_AF10
#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define TIM2_CH4_PD6_ PD6,GPIO_AF2
#define _TIM2_CH4_PA10_ 1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1
#define _TIM2_CH4_PD6_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA15_ PA15,GPIO_AF14
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define TIM2_ETR_PD3_ PD3,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1
#define _TIM2_ETR_PD3_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define TIM3_CH1_PE2_ PE2,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE2_ 1

#define TIM3_CH2_PA4_ PA4,GPIO_AF2
#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define TIM3_CH2_PE3_ PE3,GPIO_AF2
#define _TIM3_CH2_PA4_ 1
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE3_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define TIM3_CH3_PE4_ PE4,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1
#define _TIM3_CH3_PE4_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PB7_ PB7,GPIO_AF10
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define TIM3_CH4_PE5_ PE5,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PB7_ 1
#define _TIM3_CH4_PC9_ 1
#define _TIM3_CH4_PE5_ 1

#define TIM3_ETR_PB3_ PB3,GPIO_AF10
#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define _TIM3_ETR_PB3_ 1
#define _TIM3_ETR_PD2_ 1

#define TIM4_CH1_PA11_ PA11,GPIO_AF10
#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PA11_ 1
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PA12_ PA12,GPIO_AF10
#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PA12_ 1
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PA13_ PA13,GPIO_AF10
#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PA13_ 1
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PA8_ PA8,GPIO_AF10
#define TIM4_ETR_PB3_ PB3,GPIO_AF2
#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PA8_ 1
#define _TIM4_ETR_PB3_ 1
#define _TIM4_ETR_PE0_ 1

#define TIM8_BKIN_PA0_ PA0,GPIO_AF9
#define TIM8_BKIN_PA10_ PA10,GPIO_AF11
#define TIM8_BKIN_PA6_ PA6,GPIO_AF4
#define TIM8_BKIN_PB7_ PB7,GPIO_AF5
#define TIM8_BKIN_PD2_ PD2,GPIO_AF4
#define _TIM8_BKIN_PA0_ 1
#define _TIM8_BKIN_PA10_ 1
#define _TIM8_BKIN_PA6_ 1
#define _TIM8_BKIN_PB7_ 1
#define _TIM8_BKIN_PD2_ 1

#define TIM8_BKIN2_PB6_ PB6,GPIO_AF10
#define TIM8_BKIN2_PC9_ PC9,GPIO_AF6
#define TIM8_BKIN2_PD1_ PD1,GPIO_AF6
#define _TIM8_BKIN2_PB6_ 1
#define _TIM8_BKIN2_PC9_ 1
#define _TIM8_BKIN2_PD1_ 1

#define TIM8_CH1_PA15_ PA15,GPIO_AF2
#define TIM8_CH1_PB6_ PB6,GPIO_AF5
#define TIM8_CH1_PC6_ PC6,GPIO_AF4
#define _TIM8_CH1_PA15_ 1
#define _TIM8_CH1_PB6_ 1
#define _TIM8_CH1_PC6_ 1

#define TIM8_CH1N_PA7_ PA7,GPIO_AF4
#define TIM8_CH1N_PB3_ PB3,GPIO_AF4
#define TIM8_CH1N_PC10_ PC10,GPIO_AF4
#define _TIM8_CH1N_PA7_ 1
#define _TIM8_CH1N_PB3_ 1
#define _TIM8_CH1N_PC10_ 1

#define TIM8_CH2_PA14_ PA14,GPIO_AF5
#define TIM8_CH2_PB8_ PB8,GPIO_AF10
#define TIM8_CH2_PC7_ PC7,GPIO_AF4
#define _TIM8_CH2_PA14_ 1
#define _TIM8_CH2_PB8_ 1
#define _TIM8_CH2_PC7_ 1

#define TIM8_CH2N_PB0_ PB0,GPIO_AF4
#define TIM8_CH2N_PB4_ PB4,GPIO_AF4
#define TIM8_CH2N_PC11_ PC11,GPIO_AF4
#define _TIM8_CH2N_PB0_ 1
#define _TIM8_CH2N_PB4_ 1
#define _TIM8_CH2N_PC11_ 1

#define TIM8_CH3_PB9_ PB9,GPIO_AF10
#define TIM8_CH3_PC8_ PC8,GPIO_AF4
#define _TIM8_CH3_PB9_ 1
#define _TIM8_CH3_PC8_ 1

#define TIM8_CH3N_PB1_ PB1,GPIO_AF4
#define TIM8_CH3N_PB5_ PB5,GPIO_AF3
#define TIM8_CH3N_PC12_ PC12,GPIO_AF4
#define _TIM8_CH3N_PB1_ 1
#define _TIM8_CH3N_PB5_ 1
#define _TIM8_CH3N_PC12_ 1

#define TIM8_CH4_PC9_ PC9,GPIO_AF4
#define TIM8_CH4_PD1_ PD1,GPIO_AF4
#define _TIM8_CH4_PC9_ 1
#define _TIM8_CH4_PD1_ 1

#define TIM8_CH4N_PC13_ PC13,GPIO_AF6
#define TIM8_CH4N_PD0_ PD0,GPIO_AF6
#define _TIM8_CH4N_PC13_ 1
#define _TIM8_CH4N_PD0_ 1

#define TIM8_ETR_PA0_ PA0,GPIO_AF10
#define TIM8_ETR_PB6_ PB6,GPIO_AF6
#define _TIM8_ETR_PA0_ 1
#define _TIM8_ETR_PB6_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define _UART1_DE_PA12_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define _UART1_NSS_PA11_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define UART1_RX_PC5_ PC5,GPIO_AF7
#define UART1_RX_PE1_ PE1,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1
#define _UART1_RX_PC5_ 1
#define _UART1_RX_PE1_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define UART1_TX_PC4_ PC4,GPIO_AF7
#define UART1_TX_PE0_ PE0,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1
#define _UART1_TX_PC4_ 1
#define _UART1_TX_PE0_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PB5_ PB5,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PB5_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF7
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

